package tixiban.class27根据对数器找规律_根据数据量猜解法;

public class Code00笔记 {
    /**
     * 对数器找规律(暴力法找规律)
     *
     * 某道题输入类型简单,并且只有一个参数,
     * 要求的返回值类型也简单,并且只有一个或有限几个(例如“先手”,“后手”)
     * 那么先用暴力法,多打几个返回值找规律,然后直接根据规律硬编码
     */

    /**
     * 根据数据量猜解法
     *
     * 做题的时候要求的运行时间经常是: c/c++:1秒, Java/Python等:2~4秒
     * 而c/c++1秒处理的指令条数是10^8,Java/Python等1~4秒处理的指令条数也是10^8.
     *
     * 如果给定的数据量n的范围是10^6,而你用了一个O(N^2)的算法,那么肯定超时了,必须考虑O(N)或者O(logN)的算法.
     * 而如果给定的数据量n的范围是10^3,那用O(N^2)的算法就足够了.
     *
     */
}
